{
    "homeCamera":{
        "north": 59,
        "south": 58,
        "west": 5.6,
        "east":5.8
    },
    "catalog":[
        {
            "name": "Via Python/Flask server",
            "type": "group",
            "isOpen": true,
            "description": "Data-sett som går gjennom Python/Flask serveren (se https://api.dtpoc.knowit.no/).",
            "members": [
                {
                    "name":"Yr vær",
                    "type":"csv",
                    "description": "Her henter vi data fra API-et \"yr locationforcast\" (se https://api.met.no/weatherapi/locationforecast/2.0/documentation). <br>Da TerriaJS har bedre støtte for å vise hvordan atributter (feks temperatur) forandrer seg over tid for csv enn for GeoJSON, bruker vi flask-serveren som et mellomlag for å konvertere dataene fra GeoJSON til csv.",
                    "url":"https://api.dtpoc.knowit.no/yr_weather"
                },
                {
                    "name":"Se havnivå",
                    "type":"geojson",
                    "timeProperty":"time",
                    "description": "Data hentet fra se-havnivå. For at man skal kunne visualisere disse dataene i 3D-rom, bruker vi flask-serveren til å konvertere punktene fra se-havnivå til polygoner.<h3>Settings</h3>For å kunne se disse dataene på en ordenlig måte, må man gå inn på \"Map Settings\" og huke av \"3D\" og \"Terrain hides underground features\". Man kan også se hvordan tidevannet påvirker vannstanden ved å dra i tidslinje-slideren nederst i vinduet.<h3>PS:</h3>Polygonene som blir vist er ligger litt for høyt i terrenget. Dette er sannsynligvis pga surr med ulike høyde-referransesystemer.",
                    "url":"http://localhost:5000/sehavniva"
                },
                {
                    "name": "Sehavnivå (CZML)",
                    "type": "czml",
                    "url": "http://localhost:5000/sehavniva_czml",
                    "description": "Data hentet fra sehavnivå.no i Stavanger området. Her har vi brukt CZML istedet for GeoJSON for å bedre visualisere endringer over tid."
                },
                {
                    "name": "Sehavnivå Oslo (CZML)",
                    "type": "czml",
                    "url": "http://localhost:5000/sehavniva_oslo",
                    "description": "Data hentet fra sehavnivå.no i Oslo området. Vi bruker CZML-formatet for å kunne vise endringer over tid."
                },
                {
                    "name":"FKB Bygg transformert",
                    "type":"geojson",
                    "url":"http://localhost:5000/fkbbygg",
                    "description": "1000 FKB bygninger i Stavanger, med koordinatene transformert fra NN2000 til WGS84"
                },
                {
                    "name": "Tidsrekker fra SSB",
                    "type": "group",
                    "description": "Tidsrekker fra SSB. Alle disse datasettene går via flask-serveren. Dette er fordi SSB-dataene ikke har noen tidsinformasjon som Terria kan bruke, altså må vi legge på denne informasjonen for at Terria skal forstå at det dreier seg om tidsserier. Når man ønsker å se på disse dataene, burde man merke seg noen ting: <ol><li>For å enkelt kunne se dataene, er det smart å bruke kartet positron.</li><li>Slik TerriaJS fungerer by default, så begynner ikke dataene å loades inn i kartet før man har zoomet inn et stykke. Derfor må man zoome inn før man ser noe.</li><li>Når man bruker wms-tidserier i TerriaJS, loades datasettet for det neste tidsintervallet i bakgrunnen, men ingen andre. For å best se forandringene som skjer over tid, burde man gå til den tidligste tiden der dataene er tilgjengelige, vente litt på at Terria kan loade alle dataene, og så trykke på neste. Hvis man i stedet trykker på den forrige tiden for eksempel, så må Terria loade alle dataene på nytt, som fører til at man ikke har en kontinuerlig overgang fra et tidsintevall til det neste.</li></ol>",
                    "members": [
                        {
                            "type": "wms",
                            "name": "SSB landbruk",
                            "description": "Landbrukseiendommer med 1km oppløsning. <h3>PS:</h3>SSB har også data fra 2008 og 2009, men enkodingen er ganske forskjellig, som gjør det vanskelig å sammeligne dataene med 2013, 2014 og 2015.",
                            "url": "http://localhost:5000/ssb?request=GetCapabilities&service=WMS",
                            "layers": "layer_landbruk",
                            "multiplierDefaultDeltaStep": 4,
                            "dateFormat": "yyyy",
                            "styles": "en",
                            "initialTimeSource": "start"
                        },
                        {
                            "type": "wms",
                            "name": "SSB befolkning",
                            "description": "Befolkningstetthet, med 1km oppløsning. <h3>PS:</h3>Enkodingen av fargene er er litt forskjellig fra og med 2015. For årstallene før 2015 er det ingen spesiell farge for \"5000 eller flere innbyggere per km2\". Det vil si at alt som går under \"2000 eller flere innbyggere per km2\" har fargen mørkebruk i stedet for svart før 2015.",
                            "url": "http://localhost:5000/ssb?request=GetCapabilities&service=WMS",
                            "layers": "layer_befolkning",
                            "multiplierDefaultDeltaStep": 4,
                            "dateFormat": "yyyy",
                            "styles": "en",
                            "initialTimeSource": "start"
                        },
                        {
                            "type": "wms",
                            "name": "SSB bolig",
                            "description": "Bolig-tetthet, med 1km oppløsning.",
                            "url": "http://localhost:5000/ssb?request=GetCapabilities&service=WMS",
                            "layers": "layer_bolig",
                            "multiplierDefaultDeltaStep": 4,
                            "dateFormat": "yyyy",
                            "styles": "en",
                            "initialTimeSource": "start"
                        },
                        {
                            "type": "wms",
                            "name": "SSB tettsted",
                            "description": "Oversikt over norske tettsteder",
                            "url": "http://localhost:5000/ssb?request=GetCapabilities&service=WMS",
                            "layers": "layer_tettsted",
                            "multiplierDefaultDeltaStep": 4,
                            "dateFormat": "yyyy",
                            "initialTimeSource": "start"
                        }
                    ]
                }
            ]
        }
    ]
}